#pragma once

#include "Constants.hpp"
#include "Exceptions.hpp"
#include "DllNetplayManager.hpp"
#include "DllCSS.hpp"

#include <stdio.h>
#include <vector>
#include <array>
#include <windows.h>


/*

my naming schemes are horrid, but then again, i dont even know what im naming

LinkedListDataElement is for the data at 005550B0

LinkedListElement is for the data inside the list of lists in 005550A8, [[005550A8]]

*/ 

typedef struct RawMeltyVert {
	float x;
	float y;
	float z;
	float w;
	DWORD diffuse; 
	DWORD specular; 
	float u;
	float v;
} RawMeltyVert;

static_assert(sizeof(RawMeltyVert) == 0x20, "RawMeltyVert must be size 0x20");

enum class ListDrawType : BYTE {
    Unknown = 0,
    Character = 1,
    Shadow = 2,
    Effect = 3,
    HitEffect = 4
};

const char* getListDrawString(ListDrawType t);

enum class ListRetType : BYTE {
    Unknown = 0,
    DrawMenuCursor = 1,
    DrawEffectsTopUIandCharaSelect = 2,
    DrawHitEffect = 3,
    DrawBlur = 4,
    DrawCharacterSelectBackground = 5,
    DrawCharactersAndBackground = 6,
    RenderOnScreen = 7
};

const char* getListRetString(ListRetType t);

#define packedStruct struct __attribute__((packed))

typedef packedStruct RenderList {

    packedStruct LinkedListAssets { 
        // i could, maybe should, have this whole struct be a union of LinkedListAssets and LinkedListAssetsData
        // tbh i will
        // although, is this fucker always accessed as a linked list? or also as an array??
        // theres no fucking way that its,, i,,,

        packedStruct LinkedListAssetsData {
            // straight up? not fuckin sure about the size of this
            // its either going to point to another 
            // alloced at 00414EEA

            LinkedListAssets* nextAsset;

            // not sure about this one at all
            union {
                DWORD flags; //
                struct {
                    BYTE flag0; // most likely a D3DRESOURCETYPE. very weird that its only,,, one byte though,,, so it might be something else. check out 004c0243 for an explanation
                    BYTE flag1;
                    BYTE flag2;
                    BYTE flag3;
                };
            };

            union {
                RawMeltyVert verts[4];
                struct {
                    RawMeltyVert v0;
                    RawMeltyVert v1;
                    RawMeltyVert v2;
                    RawMeltyVert v3;
                };
            };

            IDirect3DTexture9* tex; // at hex 88

            DWORD LinkedListAssetsData_UNK1;
            DWORD LinkedListAssetsData_UNK2

        };

        static_assert(sizeof(LinkedListAssetsData) == 0x94, "LinkedListAssetsData size error");

        union {
            // dawg. i got NO FUCKING CLUE WHATS HAPPENING
            // basically, if this ptr + 4 is nonzero, then hit it with the switch at 004c03cb
            // and its an alloc size 94. if not, then just keep chugging down the list??!
            LinkedListAssets* nextAsset; 
            LinkedListAssetsData* nextData;
        }

        DWORD stupidFlags; // 00414e48 sets this to 0, 004C0566 skips drawing if its,, not 0?
        DWORD unknown2; // swaps between 0 and 1, not sure why. this is what doesThingsIfList+8=0 interacts with
        DWORD possibleCount; // 1600. why? im not sure

    };

    static_assert(sizeof(LinkedListAssets) == 4 * sizeof(DWORD), "LinkedListAssets size error");

    LinkedListAssets* linkedListAssets; // malloced at 0041507D with size 0x6400
    DWORD linkedListAssetsCount; // 1600, the malloc was 0x6400, 0x6400 / 0x10 is 1600.
    
    packedStruct LinkedListRender {

    };  

    LinkedListRender* linkedListRender; 

    DWORD unknownCount1;
    DWORD unknownCount1_sub;

    DWORD unknownCount2;
    DWORD unknownCount2_sub;

} RenderList;

static_assert(sizeof(RenderList) == 7 * sizeof(DWORD), "RenderList size error");

RenderList* renderList = (RenderList*)0x005550A8;



typedef struct __attribute__((packed)) LinkedListSharedData {
    DWORD address;
    
    ListDrawType drawType;
    ListRetType retType;

    BYTE unused1;
    BYTE unused2;
    DWORD id; // todo, have a database of this, and find out where copies occur
    DWORD unused3;

} LinkedListSharedData;

typedef struct __attribute__((packed)) LinkedListAssetElement {

    /*
    
    has a list of lists with:
    ptr
    0
    1 // goes between 0 and one, some kinda of validity check?
    1600 // length
    
    [[[005550A8 + 8] + 4] + 0] + 0 seems to have an address to,,, data stored in [[005550A8 + 0] + 0] + 0
    
    ok i think im high now
    at this point, new solution, log malloc for some reason

    i should have hooked malloc months ago 
    also, i need to remake a sane version of cheat engine that lets me hot load structs

    */

    LinkedListAssetElement* next;
    LinkedListAssetElement* prev;

    union {
        RawMeltyVert verts[4];
        struct {
            RawMeltyVert v0;
            RawMeltyVert v1;
            RawMeltyVert v2;
            RawMeltyVert v3;
        };
    };

    IDirect3DTexture9* tex; // 0x88

    DWORD unk1; // 8C
    DWORD unk2; // 90
    DWORD unk3; // 94
    DWORD unk4; // 98
    DWORD unk5; // 9C
    
    LinkedListSharedData data;

} LinkedListAssetElement;

// im genuinely not sure if i can go over this size. malloc is allocing things onto 0x10 boundaries, and whatever is copying is doing that too
// i should be able to change the copying, but thats a TON of extra effort
// some super weird stuff is occuring with the "melty closed but is still in task manager" thing. tbh i should probs just,,, alloc a pointer? why not? but i should be able to have more space.
// so this relies on malloc going to 0x10 bounds, copies somehow going to 0x10 bounds, heaven and hell loving me
// nope, im an idiot. 004b3b22 mallocs a0.
// im now confused about what the fuck is going on with the hex 94 area??
// that malloc is never even called (maybe called on program load?)
static_assert(sizeof(LinkedListAssetElement) == 0xB0, "LinkedListAssetElement must be size 0xA0");

typedef struct __attribute__((packed)) LinkedListRenderElement {

    /* 
    this is the data in the list at 005550B0

    the data for the list holder is created at 00415139 with that malloc call

    but the elements for this list,,,
    00414ee5? 0x004b3b1d?

    if i was human, i would have both render/asset list share the same struct? but im not even sure of that????

    */


    LinkedListRenderElement* next;
    
    // not sure about this one at all
    union {
        DWORD flags;
        struct {
            BYTE flag0; // most likely a D3DRESOURCETYPE. very weird that its only,,, one byte though,,, so it might be something else. check out 004c0243 for an explanation
            BYTE flag1;
            BYTE flag2;
            BYTE flag3;
        };
    };

    union {
        RawMeltyVert verts[4];
        struct {
            RawMeltyVert v0;
            RawMeltyVert v1;
            RawMeltyVert v2;
            RawMeltyVert v3;
        };
    };

    IDirect3DTexture9* tex; // 0x88

    DWORD unk1; // 8C
    DWORD unk2; // 90
    DWORD unk3; // 94
    DWORD unk4; // 98
    DWORD unk5; // 9C
    
    LinkedListSharedData data;

} LinkedListRenderElement;

static_assert(sizeof(LinkedListRenderElement) == 0xB0, "LinkedListRenderElement must be size idek whats going on ");

#define SHIFTHELD  (GetAsyncKeyState(VK_SHIFT) & 0x8000)
#define UPPRESS    (GetAsyncKeyState(VK_UP)    & 0x0001)
#define DOWNPRESS  (GetAsyncKeyState(VK_DOWN)  & 0x0001)
#define LEFTPRESS  (GetAsyncKeyState(VK_LEFT)  & 0x0001)
#define RIGHTPRESS (GetAsyncKeyState(VK_RIGHT) & 0x0001)

// i wish i ever got the raw strings thing to work
#define __asmStart __asm__ __volatile__ (".intel_syntax noprefix;"); __asm__ __volatile__ (
#define __asmEnd ); __asm__ __volatile__ (".att_syntax;");

#define MIN(a,b) (((a)<(b))?(a):(b))
#define MAX(a,b) (((a)>(b))?(a):(b))
#define CLAMP(value, min_val, max_val) MAX(MIN((value), (max_val)), (min_val))
#define PUSH_ALL \
    __asm__ __volatile__( \
        "push %esp;"  \
        "push %ebp;"  \
        "push %edi;"  \
        "push %esi;"  \
